backend/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30        # saniye
      arrivalRate: 10     # saniyede 10 istek

scenarios:
  - name: "Login und Technologien abrufen"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "cto@test.com"
            password: "111111"
          capture:
            - json: "$.token"
              as: "jwt"

      - get:
          url: "/tech"
          headers:
            Authorization: "Bearer {{ jwt }}"